
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль менеджера
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует табличный документ из макета ПрайсЛист и заполняет данными документа.
//
// Параметры:
//  Документ - ДокументСсылка.УстановкаЦенТоваров - ссылка печатаемого документа. 
// 
// Возвращаемое значение:
//   - ТабличныйДокумент
//
&НаСервере
Функция ПечатьПрайсЛист(Документ) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Документ.Номер КАК Номер,
		|	Документ.Дата КАК Дата,
		|	Документ.ВидЦены КАК ВидЦены,
		|	Документ.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Товар КАК Товар,
		|		Цена КАК Цена
		|	) КАК Товары
		|ИЗ
		|	Документ.УстановкаЦенТоваров КАК Документ
		|ГДЕ
		|	Документ.Ссылка = &Ссылка";

	Запрос.Параметры.Вставить("Ссылка", Документ);

	Макет 		= ПолучитьМакет("ПрайсЛист");
	ПрайсЛист 	= ПечатьСервер.ТабличныйДокументИзУниверсальногоЗапроса(Запрос, Макет);
	
	Возврат ПрайсЛист;
		
КонецФункции

#КонецОбласти