
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль объекта
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

// Обработчик события Обработка проведения.
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ЗаписатьДвиженияВЦеныТоваров();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Записывает движения документа в регистр сведений Цены товаров.
//
Процедура ЗаписатьДвиженияВЦеныТоваров()
	
	Движения.ЦеныТоваров.Записывать = Истина;
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		Движение 			= Движения.ЦеныТоваров.Добавить();
		Движение.Период 	= Дата;
		Движение.ВидЦены 	= ВидЦены;
		Движение.Товар 		= СтрокаТоваров.Товар;
		Движение.Цена 		= СтрокаТоваров.Цена;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти