
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ТабличныеЧастиКлиентСервер
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Рассчитывает цену товара документа в строке табличной части Товары;
//   
// Параметры:
//	ФормаОбъекта - ФормаКлиентскогоПриложения - форма обрабатываемого документа. 
//
Процедура УстановитьЦенуТовараВСтрокеТоваров(ФормаОбъекта) Экспорт
	
	Дата			= ФормаОбъекта.Объект.Дата;
	ВидЦены			= ФормаОбъекта.Объект.ВидЦены;
	СтрокаТоваров 	= ФормаОбъекта.Элементы.Товары.ТекущиеДанные;
	
	СтрокаТоваров.Цена 	= ЦенообразованиеВызовСервера.ЦенаТовараНаДату(СтрокаТоваров.Товар, ВидЦены, Дата);
	
КонецПроцедуры

// Рассчитывает сумму товара документа в строке табличной части Товары.
//
// Параметры:
//  СтрокаТоваров - ДанныеФормыЭлементКоллекции, ДокументТабличнаяЧастьСтрока - данные обрабатываемой строки. 
//
Процедура РассчитатьСуммуВСтрокеТоваров(СтрокаТоваров) Экспорт
	
	Сумма 				= СтрокаТоваров.Цена * СтрокаТоваров.Количество; 
	СтрокаТоваров.Сумма = Сумма;	
	
КонецПроцедуры

#КонецОбласти