
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль формы
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Обработчик события При создании на сервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок 			= Параметры.Заголовок;
	ТабличныйДокумент 	= Параметры.ТабличныйДокумент;
	КоличествоКопий 	= Параметры.КоличествоКопий;
	
	ПолеТабличногоДокумента.КоличествоЭкземпляров = КоличествоКопий;
	ПолеТабличногоДокумента.Вывести(ТабличныйДокумент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события Количество копий при изменении.
//
&НаКлиенте
Процедура КоличествоКопийПриИзменении(Элемент)
	
	ПолеТабличногоДокумента.КоличествоЭкземпляров = КоличествоКопий;
	
КонецПроцедуры

#КонецОбласти