
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль формы
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Обработчик события При чтении на сервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ФормыКлиентСервер.УстановитьОбщиеДанныеИОформлениеСправочника(ЭтаФорма);
	
КонецПроцедуры

// Обработчик события При создании на сервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ФормыКлиентСервер.УстановитьОбщиеДанныеИОформлениеСправочника(ЭтаФорма);
	КонецЕсли;
	
	ЭтоСкладПоУмолчанию 							= Объект.Ссылка = Справочники.Склады.ОсновнойСклад;
	Элементы.КонтролироватьОстаткиТоваров.Видимость = Не ЭтоСкладПоУмолчанию;
	Элементы.ПодсказкаОсновнойСклад.Видимость 		= ЭтоСкладПоУмолчанию;
	
КонецПроцедуры

#КонецОбласти

