
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль менеджера
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует табличный документ из макета СписаниеТоваров и заполняет данными документа.
//
// Параметры:
//  Документ - ДокументСсылка.СписаниеТоваров - ссылка печатаемого документа. 
// 
// Возвращаемое значение:
//   - ТабличныйДокумент
//
&НаСервере
Функция ПечатьСписаниеТоваров(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Документ.Номер КАК Номер,
		|	Документ.Дата КАК Дата,
		|	Документ.Склад КАК Склад,
		|	&Автор КАК Автор,
		|	Документ.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Товар КАК Товар,
		|		Количество КАК Количество
		|	) КАК Товары
		|ИЗ
		|	Документ.СписаниеТоваров КАК Документ
		|ГДЕ
		|	Документ.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Документ);

	Макет 			= ПолучитьМакет("СписаниеТоваров");
	СписаниеТоваров = ПечатьСервер.ТабличныйДокументИзУниверсальногоЗапроса(Запрос, Макет);
	
	Возврат СписаниеТоваров;
		
КонецФункции

#КонецОбласти