
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль объекта
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

// Процедура - Обработка проведения
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Создание сгруппированного списка товаров.
	СписокТоваров = Товары.Выгрузить();
	СписокТоваров.Свернуть("Товар", "Количество");
	
	ЗаписатьДвиженияВОстаткиТоваров(СписокТоваров);
	
	Если Не ДополнительныеСвойства.Свойство("ПроведениеБезКонтроляОстатков") Тогда
		ПроверяемыеТовары = СписокТоваров.ВыгрузитьКолонку("Товар");
		ЗапасыСервер.ПроконтролироватьОстаткиТоваров(ПроверяемыеТовары, Склад, МоментВремени(), Отказ);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Записывает движения документа в регистр накопления Остатки товаров.
//
// Параметры:
//  СписокТоваров - ТаблицаЗначений - таблица товаров. 
//
Процедура ЗаписатьДвиженияВОстаткиТоваров(СписокТоваров)
	
	Движения.ОстаткиТоваров.Записывать 				= Истина;
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
	
	Для Каждого СтрокаТоваров Из СписокТоваров Цикл
		Движение 			= Движения.ОстаткиТоваров.ДобавитьРасход();
		Движение.Период 	= Дата;
		Движение.Склад 		= Склад;
		Движение.Товар 		= СтрокаТоваров.Товар;
		Движение.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти
