
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль формы
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Обработчик события При создании на сервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Элементы.ТекущийПользователь.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Команда Настройки пользоватлей;
//  Открывает обработку Персональные настройки.
//
&НаКлиенте
Процедура ОткрытьНастройкиПользователей(Команда)
	
	ОткрытьФорму("Обработка.ПерсональныеНастройки.Форма.ПерсональныеНастройки");	
	
КонецПроцедуры

// Команда Синхронизировать.
//  Синхронизирует список пользователей в в справочнике со списком пользователей информационной базы.
//
&НаКлиенте
Процедура Синхронизировать(Команда)
	
	Текст 		= НСтр("ru = 'Запущена синхронизация списка пользователей'");
	Пояснение 	= НСтр("ru = 'Синхронизация списка пользователей из справочника со списком пользователей информационной базы'");
	ПоказатьОповещениеПользователя(Текст,, Пояснение, БиблиотекаКартинок.СоздатьНачальныйОбраз);
	
	ПользователиВызовСервера.СинхронизироватьСписокПользователей();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти



