
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль команды
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

// Обработчик события Обработка команды.
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Формирование условий отбора.
	УсловияОтбора 	= Новый Структура("Объект", ПараметрыВыполненияКоманды.Источник.Объект.Ссылка);
		
	// Открытие отчета Информация об изменениях с задаными отборами и параметрами.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", 					УсловияОтбора); 
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", 	Истина);
	
	ОткрытьФорму("Отчет.ИнформацияОбИзменениях.ФормаОбъекта", ПараметрыФормы);	
			
КонецПроцедуры

#КонецОбласти
