
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль формы
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Обработчик события При создании на сервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Информация об изменениях.
	ЛогироватьИнформациюОбИзменениях 			= ПолучитьФункциональнуюОпцию("ЛогироватьИнформациюОбИзменениях");
	Элементы.ИнформацияОбИзменениях.Видимость 	= ЛогироватьИнформациюОбИзменениях;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Гиперссылка Настройки пользователей;
//  Открывает обработку Персональные настройки.
//
&НаКлиенте
Процедура ОткрытьНастройкиПользователей(Команда)
	
	ОткрытьФорму("Обработка.ПерсональныеНастройки.Форма.ПерсональныеНастройки");	
	
КонецПроцедуры

// Гиперссылка Активные пользователи;
//  Открывает обработку Активные пользователи.
//
&НаКлиенте
Процедура ОткрытьСписокАктивныхПользователей(Команда)
	
	ОткрытьФорму("Обработка.АктивныеПользователи.Форма.Форма");
	
КонецПроцедуры

// Гиперссылка Регламентные и фоновые задания;
//  Открывает обработку Регламентные и фоновые задания.
//
&НаКлиенте
Процедура ОткрытьКонсольРегламентныхИФоновыхЗаданий(Команда)
	
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.Форма");
	
КонецПроцедуры

// Гиперссылка Поиск объектов по уникальному идентификатору;
//  Открывает обработку Поиск объектов по уникальному идентификатору.
//
&НаКлиенте
Процедура ОткрытьПоискСсылокОбъектовПоУникальномуИдентификатору(Команда)
	
	ОткрытьФорму("Обработка.ПоискСсылокПоУникальномуИдентификатору.Форма.Форма");		
	
КонецПроцедуры

// Гиперссылка Информация об изменениях;
//  Открывает регистр сведений Информация об изменениях.
//
&НаКлиенте
Процедура ОткрытьИнформациюОбИзменениях(Команда)
	
	ОткрытьФорму("РегистрСведений.ИнформацияОбИзменениях.Форма.ФормаСписка");	
	
КонецПроцедуры

// Гиперссылка Информация об изменениях;
//  Открывает отчет Информация об изменениях.
//
&НаКлиенте
Процедура ОткрытьИнформациюОбИзмененияхОтчет(Команда)
	
	ОткрытьФорму("Отчет.ИнформацияОбИзменениях.Форма");
	
КонецПроцедуры

// Гиперссылка Информация об ошибках;
//  Открывает регистр сведений Информация об ошибках.
//
&НаКлиенте
Процедура ОткрытьИнформациюОбОшибках(Команда)
	
	ОткрытьФорму("РегистрСведений.ИнформацияОбОшибках.Форма.ФормаСписка");
	
КонецПроцедуры

// Гиперссылка Категория ошибок;
//  Открывает справочник Категории ошибок.
//
&НаКлиенте
Процедура ОткрытьКатегорииОшибок(Команда)
	
	ОткрытьФорму("Справочник.КатегорииОшибок.Форма.ФормаСписка");
	
КонецПроцедуры

// Гиперссылка Консоль кода;
//  Открывает обработку Консоль кода.
//
&НаКлиенте
Процедура ОткрытьКонсольКода(Команда)
	
	ОткрытьФорму("Обработка.КонсольКода.Форма.Форма");		
	
КонецПроцедуры

// Гиперссылка Обновить повторно используемые значения;
//  Обновляет повторно используемые значения общих модулей повторного использования.
//
&НаКлиенте
Процедура ОчиститьКэшПовторноИспользуемых(Команда)
	
	ОбновитьПовторноИспользуемыеЗначения();	
	
	ТекстПредупреждения = НСтр("ru = 'Кэш повторно используемых значений очищен'");
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
КонецПроцедуры

// Гиперссылка Обновить нумерацию объектов;
//  Обновляет нумерацию объектов.
//
&НаКлиенте
Процедура ОчиститьВыданныеНезаписанныеНомера(Команда)
	
	ОчиститьВыданныеНезаписанныеНомераНаСервере();
	
	ТекстПредупреждения = НСтр("ru = 'Выданные незаписанные номера объектов очищены'");
	ПоказатьПредупреждение(, ТекстПредупреждения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновляет нумерацию объектов.
//
&НаСервереБезКонтекста
Процедура ОчиститьВыданныеНезаписанныеНомераНаСервере()
	
	ОбновитьНумерациюОбъектов();	
	
КонецПроцедуры

#КонецОбласти
