
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль менеджера значения
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

// Обработчик события При записи.
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Переключение использования регламентного задания Обновление дат запрета редактирования
	// в соответствии с устанавливаемым значением константы.
	УстановитьПривилегированныйРежим(Истина);	
	МетаданныеРегламентногоЗадания = Метаданные.РегламентныеЗадания.ОбновлениеДатЗапретаРедактирования;
	ОбщегоНазначенияСервер.ПереключитьИспользованиеРегламентногоЗадания(МетаданныеРегламентногоЗадания, Значение);	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти
