
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ИнформацияОбОшибкахВызовСервера
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Создает запись в регистре сведений Информация об ошибках.
//	Запсиь в регистре создается фоновым заданиям, для возможности корректной регистрации ошибок в транзакциях.
//
// Параметры:
//  Уровень		- ПеречислениеСсылка.УровниОшибок, Строка	- уровень ошибки. Если указан строкой,
//															  то будет выбран уровень из перечисления Уровни ошибок, найденный
//															  по переданному наименованию;
//  Категория	- СправочникСсылка.КатегорииОшибок, Строка	- категория ошибки. Если указана строкой,
//															  то будет выбрана категория из справочника Категории ошибок, найденная 
//															  по переданному наименованию или создана новая, если не найдена;												 
//  Описание	- Строка									- произвольное описание ошибки.
//
Процедура ЗарегистрироватьОшибку(Уровень, Категория, Описание) Экспорт
	
	ИнформацияОбОшибкахСервер.ЗарегистрироватьОшибку(Категория, Уровень, Описание);
		
КонецПроцедуры

#КонецОбласти