
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ПолнотекстовыйПоискДанныхВызовСервера
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает использование полнотекстового поиска данных.
//
// Параметры:
//  Значение - Булево
//
Процедура ПереключитьИспользованиеППД(Значение) Экспорт
	
	ПолнотекстовыйПоискДанныхСервер.ПереключитьИспользованиеППД(Значение);
	
КонецПроцедуры

// Обновляет дополнительный индекс полнотекстового поиска данных.
//
Процедура ОбновитьИндексППД() Экспорт
	
	ПолнотекстовыйПоискДанныхСервер.ОбновитьИндексППД();
	
КонецПроцедуры

// Объединяет дополнительный и основной индекс полнотекстового поиска данных.
//
Процедура ОбъединитьИндексыППД() Экспорт
	
	ПолнотекстовыйПоискДанныхСервер.ОбъединитьИндексыППД();
	
КонецПроцедуры

// Очищает индекс полнотекстового поиска данных.
//
Процедура ОчиститьИндексППД() Экспорт
	
	ПолнотекстовыйПоискДанныхСервер.ОчиститьИндексППД();
	
КонецПроцедуры

// Возвращает признак использования полнотекстового поиска данных.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ИспользуетсяППД() Экспорт
	
	ИспользуетсяПП = ПолнотекстовыйПоискДанныхСервер.ИспользуетсяППД();
	Возврат ИспользуетсяПП;
	
КонецФункции

#КонецОбласти