
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль команды
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

// Обработчик события Обработка команды/
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Формирование условий отбора, в зависимости от справочника, из которого выполняется команда.
	УсловияОтбора 	= Новый Структура();
	СсылкаИсточника	= ПараметрыВыполненияКоманды.Источник.Объект.Ссылка;
	ТипЗнчИсточника = ТипЗнч(СсылкаИсточника);
	
	Если ТипЗнчИсточника = Тип("СправочникСсылка.ВидыЦен") Тогда
		УсловияОтбора.Вставить("ВидЦены", СсылкаИсточника);
	ИначеЕсли ТипЗнчИсточника = Тип("СправочникСсылка.Товары") Тогда
		УсловияОтбора.Вставить("Товар", СсылкаИсточника);	
	КонецЕсли;
	
	// Открытие отчета Цены товаров с задаными отборами и параметрами.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", 					УсловияОтбора); 
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", 	Истина);

	ОткрытьФорму("Отчет.ЦеныТоваров.ФормаОбъекта", ПараметрыФормы);
		
КонецПроцедуры

#КонецОбласти
