
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ОбщиеПодпискиНаСобытияКлиентСервер
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает префикс по умолчанию для источника-справочника и плана видов характеристик.
//
Процедура УстановитьПрефиксЭлементаСправочникаИПланаВидовХарактеристик(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	// Префикс по умолчанию. 
	Префикс = "00-"
	
КонецПроцедуры

// Устанавливает префикс по умолчанию для источника-документа.
//
Процедура УстановитьПрефиксДокумента(Источник, СтандартнаяОбработка, Префикс) Экспорт	
	
	ПрефиксОрганизации = ОбщегоНазначенияВызовСервера.ЗначениеКонстанты("ПрефиксОрганизации");
	Если ПустаяСтрока(ПрефиксОрганизации) Тогда
		Префикс = "0000-";		
	Иначе
		// Например, если префикс организации "АБ", тогда префикс документа будет выглядеть как "АБ00-".
		Префикс = Лев(СтрШаблон("%(1)0000", ПрефиксОрганизации), 4) + "-";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
