
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль формы
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// // Обработчик события При создании на сервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстИнформации 									= СтрШаблон("%1 %2 | %3", Метаданные.Синоним, Метаданные.Версия, Метаданные.АвторскиеПрава);
	Элементы.НадписьИнформацияОПрограмме.Заголовок 		= ТекстИнформации;
	Элементы.СкопироватьАдресЭлектроннойПочты.Заголовок = ЭлектроннаяПочтаРазработчика();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Гиперссылка Instagram;
//  Открывает страницу профиля разработчика в Instragram в веб-браузере по умолчанию.
//
&НаКлиенте
Процедура ОткрытьПрофильInstagram(Команда)

	ИмяСоцСети = "Instagram";
	ОткрытьПрофильВСоцСети(ИмяСоцСети);	
	
КонецПроцедуры

// Гиперссылка Telegram;
//  Открывает страницу профиля разработчика в Telegram в веб-браузере по умолчанию.
//
&НаКлиенте
Процедура ОткрытьПрофильTelegram(Команда)

	ИмяСоцСети = "Telegram";
	ОткрытьПрофильВСоцСети(ИмяСоцСети);		
	
КонецПроцедуры

// Гиперссылка Instagram;
//  Открывает страницу профиля разработчика в Instagram в веб-браузере по умолчанию.
//
&НаКлиенте
Процедура ОткрытьПрофильVK(Команда)

	ИмяСоцСети = "VK";
	ОткрытьПрофильВСоцСети(ИмяСоцСети);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Гиперссылка Скопировать адрес электронной почты.
//  Копирует адрес электронной почты разработчика в буфер обмена.
//
&НаКлиенте
Процедура СкопироватьАдресЭлектроннойПочты(Команда)
	
	ЭлектроннаяПочта = ЭлектроннаяПочтаРазработчика();	
	ОбщегоНазначенияКлиент.ПоместитьТекстВБуферОбмена(ЭлектроннаяПочта);
		
	ТекстПредупреждения = НСтр("ru = 'Адрес электронной почты скопирован в буфер обмена'");		
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
КонецПроцедуры

// Показывает вопрос перед открытием страницы профиля в соцсети в веб-браузере по умолчанию.
//
// Параметры:
//  ИмяСоцСети - Строка - имя социальной сети.
//
&НаКлиенте
Процедура ОткрытьПрофильВСоцСети(ИмяСоцСети)
	
	// Определение ссылки страницы профиля по имени социальной сети.
	Если ИмяСоцСети = "Instagram" Тогда
		Ссылка = "https://www.instagram.com/fullentropppy";	
	ИначеЕсли ИмяСоцСети = "Telegram" Тогда
		Ссылка = "https://www.t.me/fullentropppy";	
	ИначеЕсли ИмяСоцСети = "VK" Тогда
		Ссылка = "https://vk.com/fullentropppy";
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Ссылка", Ссылка);
	ОписаниеОповещения		= Новый ОписаниеОповещения("ОткрытьПрофильВСоцСетиПослеОтвета", ЭтаФорма, ДополнительныеПараметры);
	ТекстВопроса			= НСтр("ru = 'Ссылка будет открыта в веб-браузере. Продолжить?'");	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

// Завершение выполнения обработчика ОткрытьПрофильВСоцСети. 
//
&НаКлиенте
Процедура ОткрытьПрофильВСоцСетиПослеОтвета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОписаниеОповещения 	= Новый ОписаниеОповещения("ОткрытьПрофильВСоцСетиПослеЗавершение", ЭтаФорма);
		СтрокаКоманды		= ДополнительныеПараметры.Ссылка;
		НачатьЗапускПриложения(ОписаниеОповещения, СтрокаКоманды);
	КонецЕсли;
	
КонецПроцедуры

// Завершение выполнения обработчика ОткрытьПрофильВСоцСетиПослеОтвета. 
//
&НаКлиенте
Процедура ОткрытьПрофильВСоцСетиПослеЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	
	// Обработка результата открытия страницы профиля в соцсети в веб-браузере по умолчанию не требуется.
	
КонецПроцедуры

// Возвращает адрес электронной почты разработчика.
// 
// Возвращаемое значение:
//   - Строка
//
&НаКлиентеНаСервереБезКонтекста
Функция ЭлектроннаяПочтаРазработчика()
	
	ЭлектроннаяПочта = "gritsenko.daniel@gmail.com";
	Возврат ЭлектроннаяПочта;
	
КонецФункции

#КонецОбласти