
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ДатыЗапретаРедактированияВызовСервера
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает доступность изменения данных на форме документа на основании даты документа и персональной даты запрета редактирования.
//
// Параметры:
//  ФормаОбъекта - ФормаКлиентскогоПриложения 	- форма с данными текущего объекта;
//  ПараметрыИсключения - Структура 			- структура из данных для исключения элементов из обработки.
//												  Если не указана, то будут использованы значения по умолчанию.
//												  Элементы структуры их значения по умолчанию при отсутствии:
//	 * ИменаЭлементовИсключений				- Массив	- массив имен элементов, которые необходимо исключить из обработки;
//	 * ИсключитьКомандыЧтения				- Булево	- исключить команды чтения из обработки. По умолчанию Истина;
//	 * ИсключитьКомандыПечати				- Булево	- исключить команды печати из обработки. По умолчанию Истина;
//	 * ИсключитьКомандыСозданияНаОсновании	- Булево	- исключить команды создания на основании из обработки. По умолчанию Истина.
//
Процедура УстановитьДоступностьРедактированияДанныхНаФормеДокумента(ФормаОбъекта, ПараметрыИсключения = Неопределено) Экспорт
	
	ДатыЗапретаРедактированияСервер.УстановитьДоступностьРедактированияДанныхНаФормеДокумента(ФормаОбъекта, ПараметрыИсключения);
	
КонецПроцедуры

// Возвращает общую дату запрета редактирования.
// 
// Возвращаемое значение:
//   - Дата
//
Функция ОбщаяДата() Экспорт
	
	ОбщаяДата = ДатыЗапретаРедактированияСервер.ОбщаяДата();
	Возврат ОбщаяДата;
	
КонецФункции

// Возвращает персональную дату запрета редактирования.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь, для которого будет получена дата.
//												   Если не указан, то будет выбран текущий пользователь.
// 
// Возвращаемое значение:
//   - Дата
//
Функция ПерсональнаяДата(Пользователь = Неопределено) Экспорт
	
	ПерсональнаяДата = ДатыЗапретаРедактированияСервер.ПерсональнаяДата(Пользователь);	
	Возврат ПерсональнаяДата;
	
КонецФункции

#КонецОбласти

