
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль СлужебныйВызовСервера
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Формирует и сохраняет структуру параметров приложения в глобальную переменную.
//
// Параметры:
//  ПараметрыПриложения	- Неопределено - глобальная переменна, используемая для хранения параметров приложения. 
//
Процедура ИнициализироватьПараметрыПриложения(ПараметрыПриложения) Экспорт
		
	СлужебныйСервер.ИнициализироватьПараметрыПриложения(ПараметрыПриложения);
	
КонецПроцедуры

#КонецОбласти