
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ОбщегоНазначенияСервер
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает заголовок программы с учетом значения константы ЗаголовокПрограммы.
// 
// Возвращаемое значение:
//   - Строка 
//
Функция ЗаголовокПрограммы() Экспорт
	
	Заголовок = ОбщегоНазначенияСервер.ЗаголовокПрограммы();
	Возврат Заголовок;
	
КонецФункции

#Область РаботаСВременнымХранилищем

// Помещает объект во временное хранилище и возвращает адрес временного хранилища.
//
// Параметры:
//  Объект - Произвольный - помещаемый во временное хранилище объект. При необходимости будет преобразован
//							в другой тип для возможности помещения во временное хранилище.
// 
// Возвращаемое значение:
//   - Строка
//
Функция АдресВременногоХранилищаОбъекта(Знач Объект) Экспорт
	
	Адрес = ОбщегоНазначенияСервер.АдресВременногоХранилищаОбъекта(Объект);
	Возврат Адрес;
	
КонецФункции

// Возвращает объект из временного хранилища.
//
// Параметры:
//  АдресВременногоХранилищ - Строка - адрес временного хранилища с объектом. 
// 
// Возвращаемое значение:
//   - Произвольный
//
Функция ОбъектИзВременногоХранилища(АдресВременногоХранилища) Экспорт

	Объект = ОбщегоНазначенияСервер.ОбъектИзВременногоХранилища(АдресВременногоХранилища);
	Возврат Объект;
		
КонецФункции

#КонецОбласти

#Область РаботаСАлгоритмами

// Выполняет проивольный код на сервере.
//
//  Возвращает структуру результата выполнения:
//	* Результат 		- Неопределено, Произвольный 	- Неопределено, если ВернутьРезультат = Ложь;
//												  		  Произвольный - результа выполнения функции;
//	* Успешно			- Булево						- признак успешного выполнения метода;
//	* ОписаниеОшибки 	- Строка						- описание ошибки при выполнения метода.
//
// Параметры:
//  ТекстКода			- Строка 		- выполняемый произвольный код. Не должен содержать процедуры и функции и оператор Возврат;
//  Параметры		 	- Проивзольный 	- произвольный параметр. Для использования, 
//										  в выполняемом тексте кода должно быть обращение к переменной Параметры;
//  ВернутьРезультат 	- Булево 		- вернуть результат выполнения произвольного кода. Для использования,
//										  в выполняемом тексте кода должно быть помещено некоторое значение в переменную Результат.
// 
// Возвращаемое значение:
//   - Структура 
//
Функция ВыполнитьПроизвольныйКодНаСервере(ТекстКода, Параметры = Неопределено, ВернутьРезультат = Ложь) Экспорт
	
	ДанныеРезультата = ОбщегоНазначенияСервер.ВыполнитьПроизвольныйКодНаСервере(ТекстКода, Параметры, ВернутьРезультат);
	Возврат ДанныеРезультата;
	
КонецФункции

#КонецОбласти

#Область РаботаСПараметрамиСеанса

// Устанавливает значение параметра сеанса по имени.
//
// Параметры:
//  ИмяПараметраСеанса 	- Строка 		- имя параметра сеанса в конфигурации;
//  Значение			- Произвольный	- устанавливаемое значение. Тип определяется параметром сеанса. 
//
Процедура УстановитьЗначениеПараметраСеанса(ИмяПараметраСеанса, Значение) Экспорт
	
	ОбщегоНазначенияСервер.УстановитьЗначениеПараметраСеанса(ИмяПараметраСеанса, Значение);
	
КонецПроцедуры

// Устанавливает значения для параметров сеанса по имени.
//
// Параметры:
//  СтруктураИменИЗначений - Структура - структура данных, где:
//	 * Ключ 	- имя параметра сеанса в конфигурации; 
//	 * Значение - устанавливаемое значение параметра сеанса. Тип определяется параметром сеанса.
//
Процедура УстановитьЗначенияПараметровСеанса(СтруктураИменИЗначений) Экспорт
	
	ОбщегоНазначенияСервер.УстановитьЗначенияПараметровСеанса(СтруктураИменИЗначений);
	
КонецПроцедуры

// Возвращает значение параметра сеанса по имени.
//
// Параметры:
//  ИмяПараметраСеанса - Строка - имя параметра сеанса в конфигурации.
// 
// Возвращаемое значение:
//   - Произвольный
//
Функция ЗначениеПараметраСеанса(ИмяПараметраСеанса) Экспорт
	
	Значение = ОбщегоНазначенияСервер.ЗначениеПараметраСеанса(ИмяПараметраСеанса);	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область РаботаСКонстантами

// Устанавливает значение константы по имени.
//
// Параметры:
//  ИмяКонстанты 	- Строка 		- имя константы в конфигурации;
//  Значение		- Произвольный	- устанавливаемое значение. Тип определяется константой. 
//
Процедура УстановитьЗначениеКонстанты(ИмяКонстанты, Значение) Экспорт
	
	ОбщегоНазначенияСервер.УстановитьЗначениеКонстанты(ИмяКонстанты, Значение);	
	
КонецПроцедуры

// Устанавливает значения для констант по имени.
//
// Параметры:
//  СтруктураИменИЗначений - Структура - структура данных, где:
//	 * Ключ 	- имя константы в конфигурации; 
//	 * Значение - устанавливаемое значение константы. Тип определяется константой.
//
Процедура УстановитьЗначенияКонстант(СтруктураИменИЗначений) Экспорт
	
	ОбщегоНазначенияСервер.УстановитьЗначенияКонстант(СтруктураИменИЗначений);
	
КонецПроцедуры

// Возвращает значение константы по имени.
//
// Параметры:
//  ИмяКонстанты - Строка - имя константы в конфигурации.
// 
// Возвращаемое значение:
//   - Произвольный
//
Функция ЗначениеКонстанты(ИмяКонстанты) Экспорт

	Значение = ОбщегоНазначенияСервер.ЗначениеКонстанты(ИмяКонстанты);
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область РаботаССылками

// Возвращает ссылку объекта по уникальному идентификатору.
//
// Параметры:
//  УникальныйИдентификатор	- УникальныйИдентификатор, Строка 	- уникальный идентификатор объекта; 
//  ИмяТаблицы				- Строка							- полное имя таблицы для поиска ссылки. Если не указано,
//																  или указано неверное, имя таблицы будет определено автоматически.
// 
// Возвращаемое значение:
//   - ЛюбаяСсылка, Неопределено
//
Функция СсылкаОбъектаПоУникальномуИдентификатору(УникальныйИдентификатор, ИмяТаблицы = Неопределено) Экспорт
	
	Ссылка = ОбщегоНазначенияСервер.СсылкаОбъектаПоУникальномуИдентификатору(УникальныйИдентификатор, ИмяТаблицы);
	Возврат Ссылка;
	
КонецФункции

// Возвращает уникальный идентификатор объекта.
//
// Параметры:
//  Ссылка	 - ЛюбаяСсылка 	- ссылка на объект; 
//  Строкой	 - Булево	 	- вернуть уникальный идентификатор преобразованный в строку.
// 
// Возвращаемое значение:
//   - УникальныйИдентификатор, Строка
//
Функция УникальныйИдентификаторСсылкиОбъекта(Ссылка, Строкой = Ложь) Экспорт
	
	УникальныйИдентификатор = ОбщегоНазначенияСервер.УникальныйИдентификаторСсылкиОбъекта(Ссылка, Строкой);
	Возврат УникальныйИдентификатор;
	
КонецФункции

// Возвращает значение реквизита объекта по имени.
//
// Параметры:
//  Ссылка		 - ЛюбаяСсылка	- ссылка на объект, содержащий реквизит, значение которого необходимо получить;
//  ИмяРеквизита - Строка		- имя реквизита объекта. 
// 
// Возвращаемое значение:
//   - Произвольный
//
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Значение = ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);			
	Возврат Значение;	
		
КонецФункции

// Возвращает значения реквизитов объекта по именам.
//  
//	Возвращает структуру значений реквизитов: 
//	* Ключ 		- Строка		- имя реквизита; 
//	* Значение 	- Произвольный	- значение реквизита.
//
// Параметры:
//  Ссылка		 - ЛюбаяСсылка		- ссылка на объект, содержащий реквизиты, значения которых необходимо получить;
//  ИмяРеквизита - Строка, Массив	- перечисление имен реквизитов в строке через запятую или в массиве. 
// 
// Возвращаемое значение:
//   - Структура
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов) Экспорт
	
	Значения = ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	Возврат Значения;
	
КонецФункции

// Возвращает иерархию элемента справочника.
//
// Параметры:
//  Ссылка				- СправочникСсылка	 - ссылка на элемент справочника, иерархию которого необходимо получить;
//  СПометкойНаУдаление	- Булево			 - вернуть элементы иерархии в том числе с пометкой на удаление;
//  Массивом			- Булево			 - вернуть иерархию в виде массива или в виде таблицы значений.
//  										   При возвращении в виде таблицы значений будет добавлена колонка Порядок
//  										   с порядком элемента, где самый верхний элемент имеет порядок 1.
// 
// Возвращаемое значение:
//   - Массив, ТаблицаЗначений
//
Функция ИерархияЭлементаСправочника(Ссылка, СПометкойНаУдаление = Истина, Массивом = Истина) Экспорт
			
	Иерархия = ОбщегоНазначенияСервер.ИерархияЭлементаСправочника(Ссылка, СПометкойНаУдаление, Массивом);
	Возврат Иерархия;
	
КонецФункции

#КонецОбласти

#КонецОбласти
