
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ОбщегоНазначенияСерверПовторногоИспользования
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает имена менеджеров объектов метаданных коллекций объектов метаданных.
// 
// Возвращаемое значение:
//   - Массив 
//
Функция ИменаМенеджеровОбъектовМетаданных() Экспорт
	
	ИменаМенеджеров = Новый Массив;
	ДобавитьВМассивИменаМенеджеровКоллекцииОбъектаМетаданнх(ИменаМенеджеров, Метаданные.Справочники);
	ДобавитьВМассивИменаМенеджеровКоллекцииОбъектаМетаданнх(ИменаМенеджеров, Метаданные.Документы);
	ДобавитьВМассивИменаМенеджеровКоллекцииОбъектаМетаданнх(ИменаМенеджеров, Метаданные.ПланыВидовХарактеристик);
	ДобавитьВМассивИменаМенеджеровКоллекцииОбъектаМетаданнх(ИменаМенеджеров, Метаданные.ПланыВидовРасчета);
	ДобавитьВМассивИменаМенеджеровКоллекцииОбъектаМетаданнх(ИменаМенеджеров, Метаданные.Задачи);
	
	Возврат ИменаМенеджеров;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет массив именами менеджеров объектов метаданных указанной коллекции объекта метаданных.
//
// Параметры:
//  Массив						- Массив 						- заполняемый массив;
//  КоллекцияОбъектовМетаданных	- КоллекцияОбъектовМетаданных 	- источник менеджеров объектов конфигурации.
//
Процедура ДобавитьВМассивИменаМенеджеровКоллекцииОбъектаМетаданнх(Массив, КоллекцияОбъектовМетаданных)
	
	Для Каждого ОбъектМетаданных Из КоллекцияОбъектовМетаданных Цикл
		ИмяМенеджераОбъекта = СтрЗаменить(ОбъектМетаданных.ПолноеИмя(), ".", "Менеджер.");
		Массив.Добавить(ИмяМенеджераОбъекта);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти