
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль формы
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Обработчик события При открытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Запрет на использование обработки вне контекста документа.
	Отказ = Истина;
	ТекстПредупреждения = НСтр("ru = 'Открытие обработки возможно только
		|из документов и списка документов'");
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
КонецПроцедуры

#КонецОбласти