
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль команды
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

// Обработчик события Обработка команды.
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Формирование передаваемых параметров в общую форму ФормаПечати.
	Заголовок 			= НСтр("ru = 'Печать списания товаров'");
	ТабличныйДокумент 	= ТабличныйДокументСписаниеТоваров(ПараметрКоманды);
		
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("Заголовок", 			Заголовок);
	ПараметрыФормы.Вставить("ТабличныйДокумент", 	ТабличныйДокумент);
	ПараметрыФормы.Вставить("КоличествоКопий",		1);
	
	// Открытие общей формы ФормаПечати с параметрами.
	ОткрытьФорму("ОбщаяФорма.ФормаПечати", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает сформированный табличный документ.
//
// Параметры:
//  Документ - ДокументСсылка.СписаниеТоваров - ссылка печатаемого документа. 
// 
// Возвращаемое значение:
//   - ТабличныйДокумент
//
&НаСервере
Функция ТабличныйДокументСписаниеТоваров(Документ) Экспорт
	
	ТабличныйДокумент = Документы.СписаниеТоваров.ПечатьСписаниеТоваров(Документ);	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти