
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ЦенообразованиеКлиент
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выводит вопрос с предложением перезаполнить цены в документе.
//
//	Модуль формы-источника вызова должен содержать экспортную процедуру для обработки ответа на вопрос
//	с предложением перезаполнения цен: ПоказатьВопросПриНеобходимостиПерезаполнитьЦеныПослеОтвета. 
//
// Параметры:
//  ФормаОбъекта - ФормаКлиентскогоПриложения - форма обрабатываемого документа.
//
Процедура ПоказатьВопросПриНеобходимостиПерезаполнитьЦены(ФормаДокумента) Экспорт
	
	Если Не (ФормаДокумента.Модифицированность И ФормаДокумента.Объект.Товары.Количество()) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ПоказатьВопросПриНеобходимостиПерезаполнитьЦеныПослеОтвета", ФормаДокумента);
	ТекстВопроса		= НСтр("ru = 'Перезаполнить цены в документе?'");		
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		
КонецПроцедуры

#КонецОбласти