
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ФормыКлиент
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обрабатывает завершение работы с окном с модифицированными данными, 
//  исключая ошибку серверного вызова при завершении работы с системой.
//	
//	Модуль формы-источника вызова должен содержать экспортную процедуру для обработки ответа на вопрос
//	о завершении работы с текущей модифицированной формой: ПроверитьМодифицированностьПередЗакрытиемПослеОтвета. 
//
// Параметры:
//  ФормаОбъекта - ФормаКлиентскогоПриложения - форма обрабатываемого объекта.
//  Отказ		 - Булево 
//
Процедура ПроверитьМодифицированностьПередЗакрытием(ФормаОбъекта, Отказ) Экспорт
	
	ФормаМодифицирована = ФормаОбъекта.Модифицированность; 
	Если Не ФормаМодифицирована Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	глПереопределяемаяПеременная = ФормаОбъекта;	
	ПодключитьОбработчикОжидания("ОбработатьЗавершениеРаботыСОкномСМодифицированнымиДанными", 0.1, Истина);
	
КонецПроцедуры

// Устанавливает текущего пользователя автором документа.
//
// Параметры:
//  ФормаОбъекта - ФормаКлиентскогоПриложения - форма обрабатываемого документа.
//
Процедура УстановитьСебяАвторомДокумента(ФормаОбъекта) Экспорт
	
	ТекущийПользователь 			= ОбщегоНазначенияВызовСервера.ЗначениеПараметраСеанса("ТекущийПользователь");
	ФормаОбъекта.Объект.Автор 		= ТекущийПользователь; 
	ФормаОбъекта.Модифицированность = Истина;
	
	ФормыКлиентСервер.УстановитьВидимостьАвтора(ФормаОбъекта);

КонецПроцедуры

#КонецОбласти