
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль объекта
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

// Обработчик события Перед записью.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьИзменениеТипаЗначенияПредопределенногоЭлемента(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет у предопределнного элемента реквизит Тип значения на предмет изменения.
//
// Параметры:
//  Отказ - Булево 
//
Процедура ПроверитьИзменениеТипаЗначенияПредопределенногоЭлемента(Отказ)
	
	Если Не ЭтоГруппа И Предопределенный И Не ТипЗначения = Ссылка.ТипЗначения Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Запрещено менять тип значения у предопределенных элементов'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти