
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль формы
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиКомандФормы

// Команда Оприходование товаров (подменю  Создать);
//  Открывает форму нового документа Оприходование товаров.
//
&НаКлиенте
Процедура СоздатьОприходованиеТоваров(Команда)
	
	ОткрытьФорму("Документ.ОприходованиеТоваров.ФормаОбъекта");
	
КонецПроцедуры

// Команда Перемещение товаров (подменю  Создать);
//  Открывает форму нового документа Перемещение товаров.
//
&НаКлиенте
Процедура СоздатьПеремещениеТоваров(Команда)
	
	ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта");
	
КонецПроцедуры

// Команда Списание товаров (подменю  Создать);
//  Открывает форму нового документа Списание товаров.
//
&НаКлиенте
Процедура СоздатьСписаниеТоваров(Команда)
	
	ОткрытьФорму("Документ.СписаниеТоваров.ФормаОбъекта");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// Обработчик события Список при активизации строки.
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
		
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Установка видимости команд печати и создания на основании в зависимости от выбранного типа документа.
	//
	// Используемые обозначения:
	// * п	- печать;
	// * со	- создание на основании.
	
	пЗначениеВидимостиОприходованиеТоваров 	= Ложь;
	пЗначениеВидимостиПеремещениеТоваров 	= Ложь;
	пЗначениеВидимостиСписаниеТоваров 		= Ложь;
	соЗначениеВидимостиПродажаТоваров 		= Ложь;
	соЗначениеВидимостиПеремещениеТоваров 	= Ложь;
	соЗначениеВидимостиСписаниеТоваров 		= Ложь;
	
	ТекущийТип = ТекущиеДанные.Тип;
	Если ТекущийТип = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		пЗначениеВидимостиОприходованиеТоваров 	= Истина;
		соЗначениеВидимостиПродажаТоваров 		= Истина;
		соЗначениеВидимостиПеремещениеТоваров 	= Истина;
		соЗначениеВидимостиСписаниеТоваров 		= Истина;
	ИначеЕсли ТекущийТип = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		пЗначениеВидимостиПеремещениеТоваров 	= Истина;
		соЗначениеВидимостиПродажаТоваров 		= Истина;
		соЗначениеВидимостиСписаниеТоваров 		= Истина;
	ИначеЕсли ТекущийТип = Тип("ДокументСсылка.СписаниеТоваров") Тогда
		пЗначениеВидимостиСписаниеТоваров = Истина;	
	КонецЕсли;
	
	пКоманды = Элементы.ПодменюПечать.ПодчиненныеЭлементы;
	Если Не пКоманды.Найти("ФормаДокументОприходованиеТоваровПечатьОприходованиеТоваров") = Неопределено Тогда
		пКоманды.ФормаДокументОприходованиеТоваровПечатьОприходованиеТоваров.Видимость = пЗначениеВидимостиОприходованиеТоваров;
	КонецЕсли;
	Если Не пКоманды.Найти("ФормаДокументПеремещениеТоваровПечатьПеремещенияТоваров") = Неопределено Тогда
		пКоманды.ФормаДокументПеремещениеТоваровПечатьПеремещенияТоваров.Видимость = пЗначениеВидимостиПеремещениеТоваров;
	КонецЕсли;
	Если Не пКоманды.Найти("ФормаДокументСписаниеТоваровПечатьСписаниеТоваров") = Неопределено Тогда
		пКоманды.ФормаДокументСписаниеТоваровПечатьСписаниеТоваров.Видимость = пЗначениеВидимостиСписаниеТоваров;
	КонецЕсли;
	
	соКоманды = Элементы.ПодменюСоздатьНаОсновании.ПодчиненныеЭлементы;
	Если Не соКоманды.Найти("ФормаДокументПродажаТоваровСоздатьНаОсновании") = Неопределено Тогда
		соКоманды.ФормаДокументПродажаТоваровСоздатьНаОсновании.Видимость = соЗначениеВидимостиПродажаТоваров;
	КонецЕсли;
	Если Не соКоманды.Найти("ФормаДокументПеремещениеТоваровСоздатьНаОсновании") = Неопределено Тогда
		соКоманды.ФормаДокументПеремещениеТоваровСоздатьНаОсновании.Видимость = соЗначениеВидимостиПеремещениеТоваров;
	КонецЕсли;
	Если Не соКоманды.Найти("ФормаДокументСписаниеТоваровСоздатьНаОсновании") = Неопределено Тогда
		соКоманды.ФормаДокументСписаниеТоваровСоздатьНаОсновании.Видимость = соЗначениеВидимостиСписаниеТоваров;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

