
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль менеджера
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует табличный документ из макета ПеремещениеТоваров и заполняет данными документа.
//
// Параметры:
//  Документ - ДокументСсылка.ПеремещениеТоваров - ссылка печатаемого документа. 
// 
// Возвращаемое значение:
//   - ТабличныйДокумент
//
&НаСервере
Функция ПечатьПеремещениеТоваров(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Документ.Номер КАК Номер,
		|	Документ.Дата КАК Дата,
		|	Документ.СкладОтправитель КАК СкладОтправитель,
		|	Документ.СкладПолучатель КАК СкладПолучатель,
		|	&Автор КАК Автор,
		|	Документ.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Товар КАК Товар,
		|		Количество КАК Количество
		|	) КАК Товары
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК Документ
		|ГДЕ
		|	Документ.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Документ);

	Макет 				= ПолучитьМакет("ПеремещениеТоваров");
	ПеремещениеТоваров 	= ПечатьСервер.ТабличныйДокументИзУниверсальногоЗапроса(Запрос, Макет);
	
	Возврат ПеремещениеТоваров;
	
КонецФункции

#КонецОбласти