
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ПерсональныеНастройкиВызовСервера
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщиеНастройки

// Устанавливает значение настройки ЗапрашиватьПодтверждение объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Значение		- Булево - значение устанавливаемой настройки;
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки.
// 
Процедура УстановитьЗначениеЗапрашиватьПодтверждение(Значение, ИмяПользователя = Неопределено) Экспорт
	
	ПерсональныеНастройкиСервер.УстановитьЗначениеЗапрашиватьПодтверждение(Значение, ИмяПользователя);	
	
КонецПроцедуры

// Возвращает значение настройки ЗапрашиватьПодтверждение объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  ИмяПользователя - Строка - имя пользователя информационной базы, значение настройки которого необходимо получить.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ЗначениеЗапрашиватьПодтверждение(ИмяПользователя = Неопределено) Экспорт
	
	Значение = ПерсональныеНастройкиСервер.ЗначениеЗапрашиватьПодтверждение(ИмяПользователя);
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область НастройкиМаркетинга

// Устанавливает значение настройки ОсновнойВидЦенПоступленияТоваров объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Значение		- Булево - значение устанавливаемой настройки;
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки.
// 
Процедура УстановитьЗначениеОсновнойВидЦенПоступленияТоваров(Значение, ИмяПользователя = Неопределено) Экспорт
	
	ПерсональныеНастройкиСервер.УстановитьЗначениеОсновнойВидЦенПоступленияТоваров(Значение, ИмяПользователя);	
	
КонецПроцедуры

// Возвращает значение настройки ОсновнойВидЦенПоступленияТоваров объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  ИмяПользователя - Строка - имя пользователя информационной базы, значение настройки которого необходимо получить.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ЗначениеОсновнойВидЦенПоступленияТоваров(ИмяПользователя = Неопределено) Экспорт
	
	Значение = ПерсональныеНастройкиСервер.ЗначениеОсновнойВидЦенПоступленияТоваров(ИмяПользователя);		
	Возврат Значение;
	
КонецФункции

// Устанавливает значение настройки ОсновнойВидЦенПродажаТоваров объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Значение		- Булево - значение устанавливаемой настройки;
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки.
// 
Процедура УстановитьЗначениеОсновнойВидЦенПродажаТоваров(Значение, ИмяПользователя = Неопределено) Экспорт
	
	ПерсональныеНастройкиСервер.УстановитьЗначениеОсновнойВидЦенПродажаТоваров(Значение, ИмяПользователя);	

КонецПроцедуры

// Возвращает значение настройки ОсновнойВидЦенПродажаТоваров объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  ИмяПользователя - Строка - имя пользователя информационной базы, значение настройки которого необходимо получить.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ЗначениеОсновнойВидЦенПродажаТоваров(ИмяПользователя = Неопределено) Экспорт
	
	Значение = ПерсональныеНастройкиСервер.ЗначениеОсновнойВидЦенПродажаТоваров(ИмяПользователя);	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область НастройкиСкладов

// Устанавливает значение настройки ОсновнойСклад объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Значение		- Булево - значение устанавливаемой настройки;
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки.
// 
Процедура УстановитьЗначениеОсновнойСклад(Значение, ИмяПользователя = Неопределено) Экспорт
	
	ПерсональныеНастройкиСервер.УстановитьЗначениеОсновнойСклад(Значение, ИмяПользователя);	
	
КонецПроцедуры

// Возвращает значение настройки ОсновнойСклад объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  ИмяПользователя - Строка - имя пользователя информационной базы, значение настройки которого необходимо получить.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ЗначениеОсновнойСклад(ИмяПользователя = Неопределено) Экспорт
	
	Значение = ПерсональныеНастройкиСервер.ЗначениеОсновнойСклад(ИмяПользователя);	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область НастройкиПечати

// Устанавливает значение настройки ФИОДляПечати объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Значение		- Булево - значение устанавливаемой настройки;
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки.
// 
Процедура УстановитьЗначениеФИОДляПечати(Значение, ИмяПользователя = Неопределено) Экспорт
	
	ПерсональныеНастройкиСервер.УстановитьЗначениеФИОДляПечати(Значение, ИмяПользователя);	
	
КонецПроцедуры

// Возвращает значение настройки ФИОДляПечати объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  ИмяПользователя - Строка - имя пользователя информационной базы, значение настройки которого необходимо получить.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ЗначениеФИОДляПечати(ИмяПользователя = Неопределено) Экспорт
	
	Значение = ПерсональныеНастройкиСервер.ЗначениеФИОДляПечати(ИмяПользователя);	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#КонецОбласти