
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль формы
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Обработчик события При открытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокРазрядности();
	УстановитьДоступностьПараметраРазрядности();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события Разрядность округления дробной части при изменении.
//
&НаКлиенте
Процедура РазрядностьОкругленияДробнойЧастиПриИзменении(Элемент)
	
	УстановитьЗаголовокРазрядности();	
	УстановитьДоступностьПараметраРазрядности();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Команда Округлить;
//  Передает параметры округления в форму-источник вызова текущей формы.
//
&НаКлиенте
Процедура Округлить(Команда)
	
	Если Разрядность = 0 Тогда
		ПреобразованнаяРазрядность = 1;
	ИначеЕсли Разрядность = 1 Тогда
		ПреобразованнаяРазрядность = 0;
	ИначеЕсли Разрядность = 2 Тогда
		ПреобразованнаяРазрядность = -1;
	ИначеЕсли Разрядность = 3 Тогда
		ПреобразованнаяРазрядность = -2;
	ИначеЕсли Разрядность = 4 Тогда
		ПреобразованнаяРазрядность = -3;
	ИначеЕсли Разрядность = 5 Тогда
		ПреобразованнаяРазрядность = -4;
	ИначеЕсли Разрядность = 6 Тогда
		ПреобразованнаяРазрядность = -5;
	ИначеЕсли Разрядность = 7 Тогда
		ПреобразованнаяРазрядность = -6;
	КонецЕсли;
	
	ТекущийРежим = ?(Режим = 0, РежимОкругления.Окр15как10, РежимОкругления.Окр15как20);
	
	ПараметрыОкругления = Новый Структура;
	ПараметрыОкругления.Вставить("Разрядность", 		ПреобразованнаяРазрядность);
	ПараметрыОкругления.Вставить("ПараметрРазрядности", ПараметрРазрядности);
	ПараметрыОкругления.Вставить("Режим", 				ТекущийРежим);
	
	Закрыть(ПараметрыОкругления);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает заголовок разрядности, добавляя представления выбранной разрядности.
//
&НаКлиенте
Процедура УстановитьЗаголовокРазрядности()
	
	Если Разрядность = 0 Тогда
		ПриставкаЗаголовкаЭлемента = НСтр("ru = 'до десятой части'");
	ИначеЕсли Разрядность = 1 Тогда
		ПриставкаЗаголовкаЭлемента = НСтр("ru = 'до целой части'");
	ИначеЕсли Разрядность = 2 Тогда
		ПриставкаЗаголовкаЭлемента = НСтр("ru = 'до десятков'");
	ИначеЕсли Разрядность = 3 Тогда
		ПриставкаЗаголовкаЭлемента = НСтр("ru = 'до сотен'");
	ИначеЕсли Разрядность = 4 Тогда
		ПриставкаЗаголовкаЭлемента = НСтр("ru = 'до тысяч'");
	ИначеЕсли Разрядность = 5 Тогда
		ПриставкаЗаголовкаЭлемента = НСтр("ru = 'до десятков тысяч'");
	ИначеЕсли Разрядность = 6 Тогда
		ПриставкаЗаголовкаЭлемента = НСтр("ru = 'до сотен тысяч'");
	ИначеЕсли Разрядность = 7 Тогда
		ПриставкаЗаголовкаЭлемента = НСтр("ru = 'до миллионов'");
	КонецЕсли;
	
	ЗаголовокЭлемента 				= СтрШаблон(НСтр("ru = 'Разрядность (%1)'"), ПриставкаЗаголовкаЭлемента);
	Элементы.Разрядность.Заголовок 	= ЗаголовокЭлемента;
	
КонецПроцедуры

// Устанавливает доступность параметра разрядности.
//
&НаКлиенте
Процедура УстановитьДоступностьПараметраРазрядности()
	
	ЗначениеДоступности = Разрядность > 1;
	Элементы.ПараметрРазрядности.Доступность = ЗначениеДоступности;
	
КонецПроцедуры

#КонецОбласти
