
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ЦенообразованиеВызовСервера
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает цену товара по виду цены на дату.
//
// Параметры:
//  Товар	 - СправочникСсылка.Товары	- товар, цену которого необходимо получить;
//  ВидЦены	 - СправочникСсылка.ВидыЦен	- вид получаемой цены товара;
//  Дата	 - Дата 					- дата, на которую необходимо получить цену.
//										  Если не указана, будет выбрана текущая дата. 
// 
// Возвращаемое значение:
//   - Число 
//
Функция ЦенаТовараНаДату(Товар, ВидЦены, Дата = Неопределено) Экспорт
	
	Цена = ЦенообразованиеСервер.ЦенаТовараНаДату(Товар, ВидЦены, Дата);			
	Возврат Цена;
	
КонецФункции

#КонецОбласти