
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ПерсональныеНастройкиСервер
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщиеНастройки

// Устанавливает значение настройки ЗапрашиватьПодтверждение объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Значение		- Булево - значение устанавливаемой настройки;
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки.
// 
Процедура УстановитьЗначениеЗапрашиватьПодтверждение(Значение, ИмяПользователя = Неопределено) Экспорт
	
	УстановитьЗначениеПерсональнойНастройки("ЗапрашиватьПодтверждение", Значение, ИмяПользователя);
	
КонецПроцедуры

// Возвращает значение настройки ЗапрашиватьПодтверждение объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  ИмяПользователя - Строка - имя пользователя информационной базы, значение настройки которого необходимо получить.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ЗначениеЗапрашиватьПодтверждение(ИмяПользователя = Неопределено) Экспорт
	
	Значение = ЗначениеПерсональнойНастройки("ЗапрашиватьПодтверждение", ИмяПользователя);	
	Возврат Значение;

КонецФункции

#КонецОбласти

#Область НастройкиМаркетинга

// Устанавливает значение настройки ОсновнойВидЦенПоступленияТоваров объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Значение		- Булево - значение устанавливаемой настройки;
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки.
// 
Процедура УстановитьЗначениеОсновнойВидЦенПоступленияТоваров(Значение, ИмяПользователя = Неопределено) Экспорт
	
	УстановитьЗначениеПерсональнойНастройки("ОсновнойВидЦенПоступленияТоваров", Значение, ИмяПользователя);
	
КонецПроцедуры

// Возвращает значение настройки ОсновнойВидЦенПоступленияТоваров объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  ИмяПользователя - Строка - имя пользователя информационной базы, значение настройки которого необходимо получить.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ЗначениеОсновнойВидЦенПоступленияТоваров(ИмяПользователя = Неопределено) Экспорт
	
	Значение = ЗначениеПерсональнойНастройки("ОсновнойВидЦенПродажаТоваров", ИмяПользователя);	
	Возврат Значение;

КонецФункции

// Устанавливает значение настройки ОсновнойВидЦенПродажаТоваров объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Значение		- Булево - значение устанавливаемой настройки;
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки.
// 
Процедура УстановитьЗначениеОсновнойВидЦенПродажаТоваров(Значение, ИмяПользователя = Неопределено) Экспорт
	
	УстановитьЗначениеПерсональнойНастройки("ОсновнойВидЦенПродажаТоваров", Значение, ИмяПользователя);
	
КонецПроцедуры

// Возвращает значение настройки ОсновнойВидЦенПродажаТоваров объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  ИмяПользователя - Строка - имя пользователя информационной базы, значение настройки которого необходимо получить.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ЗначениеОсновнойВидЦенПродажаТоваров(ИмяПользователя = Неопределено) Экспорт
	
	Значение = ЗначениеПерсональнойНастройки("ОсновнойВидЦенПродажаТоваров", ИмяПользователя);	
	Возврат Значение;

КонецФункции

#КонецОбласти

#Область НастройкиСкладов

// Устанавливает значение настройки ОсновнойСклад объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Значение		- Булево - значение устанавливаемой настройки;
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки.
// 
Процедура УстановитьЗначениеОсновнойСклад(Значение, ИмяПользователя = Неопределено) Экспорт
	
	УстановитьЗначениеПерсональнойНастройки("ОсновнойСклад", Значение, ИмяПользователя);
	
КонецПроцедуры

// Возвращает значение настройки ОсновнойСклад объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  ИмяПользователя - Строка - имя пользователя информационной базы, значение настройки которого необходимо получить.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ЗначениеОсновнойСклад(ИмяПользователя = Неопределено) Экспорт
	
	Значение = ЗначениеПерсональнойНастройки("ОсновнойСклад", ИмяПользователя);	
	Возврат Значение;

КонецФункции

#КонецОбласти

#Область НастройкиПечати

// Устанавливает значение настройки ФИОДляПечати объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Значение		- Булево - значение устанавливаемой настройки;
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки.
// 
Процедура УстановитьЗначениеФИОДляПечати(Значение, ИмяПользователя = Неопределено) Экспорт
	
	УстановитьЗначениеПерсональнойНастройки("ФИОДляПечати", Значение, ИмяПользователя);
	
КонецПроцедуры

// Возвращает значение настройки ФИОДляПечати объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ЗначениеФИОДляПечати(ИмяПользователя = Неопределено) Экспорт
	
	Значение = ЗначениеПерсональнойНастройки("ФИОДляПечати", ИмяПользователя);	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает значение настройки объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Настройка			- Строка		- имя настройки;  
//  Значение			- Произвольный	- устанавливаемое значение;
//  ИмяПользователя		- Строка		- имя пользователя информационной базы, для которого устанавливается значение настройки. 
//
Процедура УстановитьЗначениеПерсональнойНастройки(Настройка, Значение, ИмяПользователя = Неопределено)
	
	ХранилищеОбщихНастроек.Сохранить("ПерсональныеНастройки", Настройка, Значение,, ИмяПользователя);
	
КонецПроцедуры

// Возвращает значение настройки объекта настройки ПерсональныеНастройки.
//
// Параметры:
//  Настройка		- Строка - имя настройки.  
//  ИмяПользователя	- Строка - имя пользователя информационной базы, для которого устанавливается значение настройки. 
// 
// Возвращаемое значение:
//   - Произвольный 
//
Функция ЗначениеПерсональнойНастройки(Настройка, ИмяПользователя)
	
	Значение = ХранилищеОбщихНастроек.Загрузить("ПерсональныеНастройки", Настройка,, ИмяПользователя);
	Возврат Значение;
	
КонецФункции

#КонецОбласти