
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль ОбщегоНазначенияКлиент
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РаботаСПрограммой

// Помещает текст в буфер обмена.
//
// Параметры:
//  Текст - Число, Строка - текст, помещаемый в буфер обмена. 
//
Процедура ПоместитьТекстВБуферОбмена(Текст) Экспорт
	
	ОбъектКопирования = Новый COMОбъект("htmlfile"); 
	ОбъектКопирования.ParentWindow.ClipboardData.SetData("Text", Текст);	
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСАлгоритмами

// Выполняет проивольный код на клиенте.
//
//  Возвращает структуру результата выполнения:
//	* Результат 		- Неопределено, Произвольный 	- Неопределено, если ВернутьРезультат = Ложь;
//												  		  Произвольный - результа выполнения функции;
//	* Успешно			- Булево						- признак успешного выполнения метода;
//	* ОписаниеОшибки 	- Строка						- описание ошибки при выполнения метода.
//
// Параметры:
//  ТекстКода			- Строка 		- выполняемый произвольный код. Не должен содержать процедуры и функции и оператор Возврат;
//										  
//  Параметры		 	- Проивзольный 	- произвольный параметр. Для использования, 
//										  в выполняемом тексте кода должно быть обращение к переменной Параметры;
//  ВернутьРезультат 	- Булево 		- вернуть результат выполнения произвольного кода. Для использования,
//										  в выполняемом тексте кода должно быть помещено некоторое значение в переменную Результат.
// 
// Возвращаемое значение:
//   - Структура 
//
Функция ВыполнитьПроизвольныйКодНаКлиенте(ТекстКода, Параметры = Неопределено, ВернутьРезультат = Ложь) Экспорт
	
	Результат = Неопределено;
	
	ДанныеРезультата = Новый Структура;
	ДанныеРезультата.Вставить("Результат", 		Неопределено);
	ДанныеРезультата.Вставить("Успешно", 		Истина);
	ДанныеРезультата.Вставить("ОписаниеОшибки", "");
	    
	Попытка
		Выполнить(ТекстКода);		
		Если ВернутьРезультат Тогда
			ДанныеРезультата.Результат = Результат;
		КонецЕсли;
	Исключение
		ДанныеРезультата.Успешно 		= Ложь;
		ДанныеРезультата.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ДанныеРезультата;
	
КонецФункции

#КонецОбласти

#КонецОбласти
