
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Модуль команды
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

// Обработчик события Обработка команды.
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	// Формирование условий отбора и параметров.
	СсылкаИсточника	= ПараметрыВыполненияКоманды.Источник.Объект.Ссылка;
	УсловияОтбора 	= Новый Структура("Объект", СсылкаИсточника);
	ПараметрыФормы 	= Новый Структура("Отбор", УсловияОтбора);
	
	ОткрытьФорму("РегистрСведений.ИнформацияОбИзменениях.Форма.ФормаСписка", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти