
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// © Гриценко Даниил 2021-2023г. | Общий модуль СлужебныйСервер
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Формирует и сохраняет структуру параметров приложения в глобальную переменную.
//
// Параметры:
//  ПараметрыПриложения	- Неопределено - глобальная переменна, используемая для хранения параметров приложения. 
//
Процедура ИнициализироватьПараметрыПриложения(ПараметрыПриложения) Экспорт
		
	ПараметрыПриложения = Новый Структура;
	
	// Заголовок - заголовок окна программы.
	Заголовок = ОбщегоНазначенияСервер.ЗаголовокПрограммы();
	ПараметрыПриложения.Вставить("Заголовок", Заголовок);
	
	// ЗапрашиватьПодтверждение - запрашивать подтверждение при завершении работы с программой.
	ЗапрашиватьПодтверждение = ПерсональныеНастройкиСервер.ЗначениеЗапрашиватьПодтверждение();
	Если ЗапрашиватьПодтверждение = Неопределено Тогда
		ПерсональныеНастройкиСервер.УстановитьЗначениеЗапрашиватьПодтверждение(Истина);
		ЗапрашиватьПодтверждение = Истина;
	КонецЕсли;
	ПараметрыПриложения.Вставить("ЗапрашиватьПодтверждение", ЗапрашиватьПодтверждение);
	
КонецПроцедуры

#КонецОбласти
